Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/edc/PIC32CM2532JH00064.PIC
      <edc:SFRDef edc:_addr="0x41002108" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="LENGTH" edc:impl="0xFFFFFFFC" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:desc="Length" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100210C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002110" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCC0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002114" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCC1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002118" edc:access="rrrrrrrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:cname="DID" edc:impl="0xFFBFFFFF" edc:mclr="00010001000001100000000100010000" edc:nzwidth="0x20" edc:por="00010001000001100000000100010000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="Device Select" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_100PIN_CAN" edc:desc="512 KB Flash / 64 KB SRAM / 100-pin / CAN" edc:when="(field &amp; 0xFF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_64PIN_CAN" edc:desc="512 KB Flash / 64 KB SRAM / 64-pin / CAN" edc:when="(field &amp; 0xFF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_48PIN_CAN" edc:desc="512 KB Flash / 64 KB SRAM / 48-pin / CAN" edc:when="(field &amp; 0xFF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_32PIN_CAN" edc:desc="512 KB Flash / 64 KB SRAM / 32-pin / CAN" edc:when="(field &amp; 0xFF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_100PIN_CAN" edc:desc="256 KB Flash / 32 KB SRAM / 100-pin / CAN" edc:when="(field &amp; 0xFF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_64PIN_CAN" edc:desc="256 KB Flash / 32 KB SRAM / 64-pin / CAN" edc:when="(field &amp; 0xFF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_48PIN_CAN" edc:desc="256 KB Flash / 32 KB SRAM / 48-pin / CAN" edc:when="(field &amp; 0xFF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_32PIN_CAN" edc:desc="256 KB Flash / 32 KB SRAM / 32-pin / CAN" edc:when="(field &amp; 0xFF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_100PIN_NOCAN" edc:desc="256 KB Flash / 32 KB SRAM / 100-pin / No CAN" edc:when="(field &amp; 0xFF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_100PIN_NOCAN" edc:desc="512 KB Flash / 64 KB SRAM / 100-pin / No CAN" edc:when="(field &amp; 0xFF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_64PIN_NOCAN" edc:desc="512 KB Flash / 64 KB SRAM / 64-pin / No CAN" edc:when="(field &amp; 0xFF) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_64PIN_NOCAN" edc:desc="256 KB Flash / 32 KB SRAM / 64-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_48PIN_NOCAN" edc:desc="256 KB Flash / 32 KB SRAM / 48-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_48PIN_NOCAN" edc:desc="512 KB Flash / 64 KB SRAM / 48-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_32PIN_NOCAN" edc:desc="512 KB Flash / 64 KB SRAM / 32-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_32PIN_NOCAN" edc:desc="256 KB Flash / 32 KB SRAM / 32-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x16"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision Number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:desc="Die Number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SERIES" edc:desc="Series" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="JH00_JH01" edc:desc="PIC32CM JH00 and PIC32CM JH01" edc:when="(field &amp; 0x3F) == 6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FAMILY" edc:desc="Family" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="5V Industrial" edc:when="(field &amp; 0x1F) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCESSOR" edc:desc="Processor" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Cortex-M0+" edc:when="(field &amp; 0xF) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
