Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/edc/PIC32CM2532JH00064.PIC
      <edc:SFRDef edc:_addr="0x4200480E" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINLT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="Window Lower Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004810" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINUT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="Window Upper Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004812" edc:access="----nnnnnnnnnnnn" edc:cname="GAINCORR" edc:impl="0xFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction Value" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004814" edc:access="----nnnnnnnnnnnn" edc:cname="OFFSETCORR" edc:impl="0xFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction Value" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004816" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42004818" edc:access="------nn" edc:cname="SWTRIG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="ADC Flush" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start ADC Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004819" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4200481C" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200481D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42004820" edc:access="-----rrrrrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0x7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="SWRST Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ENABLE Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:desc="INPUTCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLC" edc:desc="CTRLC Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:desc="AVGCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:desc="SAMPCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="WINLT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="WINUT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="GAINCORR Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="OFFSETCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:desc="SWTRG Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004822" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42004824" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RESULT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="RESULT" edc:desc="Result Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004826" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42004828" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SEQCTRL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="SEQEN" edc:desc="Enable Positive Input in the Sequence" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200482C" edc:access="-----nnn-----nnn" edc:cname="CALIB" edc:impl="0x707" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:desc="Bias Comparator Scaling" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:desc="Bias Reference Buffer Scaling" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200482E" edc:offset="0x3D2"/>
      <edc:SFRDef edc:_addr="0x42004C00" edc:access="------nn" edc:cname="CTRLA" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C01" edc:access="----nnnn" edc:cname="CTRLB" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="START0" edc:desc="Comparator 0 Start Comparison" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START1" edc:desc="Comparator 1 Start Comparison" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START2" edc:desc="Comparator 2 Start Comparison" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START3" edc:desc="Comparator 3 Start Comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C02" edc:access="nnnnnnnn--nnnnnn" edc:cname="EVCTRL" edc:impl="0xFF3F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMPEO0" edc:desc="Comparator 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPEO1" edc:desc="Comparator 1 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPEO2" edc:desc="Comparator 2 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPEO3" edc:desc="Comparator 3 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINEO0" edc:desc="Window 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINEO1" edc:desc="Window 1 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COMPEI0" edc:desc="Comparator 0 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPEI1" edc:desc="Comparator 1 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPEI2" edc:desc="Comparator 2 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPEI3" edc:desc="Comparator 3 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI0" edc:desc="Comparator 0 Input Event Invert Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI1" edc:desc="Comparator 1 Input Event Invert Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI2" edc:desc="Comparator 2 Input Event Invert Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI3" edc:desc="Comparator 3 Input Event Invert Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C04" edc:access="--nnnnnn" edc:cname="INTENCLR" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:desc="Comparator 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:desc="Comparator 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP2" edc:desc="Comparator 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP3" edc:desc="Comparator 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:desc="Window 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WIN1" edc:desc="Window 1 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C05" edc:access="--nnnnnn" edc:cname="INTENSET" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:desc="Comparator 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:desc="Comparator 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP2" edc:desc="Comparator 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP3" edc:desc="Comparator 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:desc="Window 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WIN1" edc:desc="Window 1 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C06" edc:access="--nnnnnn" edc:cname="INTFLAG" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:desc="Comparator 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:desc="Comparator 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP2" edc:desc="Comparator 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP3" edc:desc="Comparator 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:desc="Window 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WIN1" edc:desc="Window 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
